Repository: jetsam729/stop-bad-regs
Catalog: languages/sfs-plugin-*.po
Languages: ru_ru

source: Although there are legitimate reasons for using the eval function, and Javascript uses it frequently, finding eval in PHP code is in the very least bad practice, and the worst is used to hide malicious code. If eval() comes up in a scan, try to get rid of it.
ru_ru: Хотя существуют достаточные причины для использования функции eval() и Javascript использует ее часто, поиск eval() в PHP-коде не является плохой идеей, т.к. это может скрывать вредоносный код. Если при сканировании появляется eval(), попытайтесь избавиться от него.

source: Your code could contain 'eval', or 'document.write(unescape(' or 'try{window.onload' or setAttribute('src'. These are markers for problems such as SQL injection or cross-browser Javascript. &lt;script&gt; tags should occur in your posts, if you added them, but should not be found anywhere else, except options. Options often have scripts for displaying Facebook, Twitter, etc. Be careful, though, if one appears in an option. Most of the time it is OK, but make sure.
ru_ru: Ваш код может содержать 'eval' или 'document.write (unescape(' или 'try {window.onload' или setAttribute('src'). Это маркеры для таких проблем, как SQL-инъекция или кросс-браузерный Javascript.; &lt;script&gt; теги должны присутствовать в ваших сообщениях, если вы их добавили, но их не следует искать где-либо еще, кроме опций. У опций часто есть скрипты для отображения Facebook, Twitter и т. д. Будьте осторожны, если один из них присутствует в опциях.

source: Files
ru_ru: Файлы

source: Stop Spammers — Multisite
ru_ru: Stop Spammers — Мультисайт (WPMU)

source: Network of Blogs
ru_ru: Сеть блогов

source: If you are running WPMU and want to control options and history through the main login admin panel, select ON. If you select OFF, each blog will have to configure the plugin separately, and each blog will have a separte history.
ru_ru: Если вы работаете с WPMU и хотите управлять параметрами и историей с помощью главной панели администратора, выберите ON. Если вы выберете OFF, каждый блог будет настраивать плагин отдельно, и у каждого блога будет отдельная история.<br />WPMU (мультисайт) — это режим работы WordPress, который позволяет использовать имеющиеся файлы ядра и существующую базу данных для создания сети из сайтов WordPress. При этом каждый сайт в сети имеет свои собственные настройки, а плагины, темы и пользователи становятся общими, что дает ряд преимуществ.

source: Networked ON
ru_ru: Режим сети включен

source: Networked OFF
ru_ru: Режим сети выключен

source: Network Blog Option
ru_ru: Настройки сети из блогов (WPMU)

source: Stop Spammers — Log Report
ru_ru: Stop Spammers — лог отчетов

source: Activity Log Cleared
ru_ru: Лог отчетов очищен

source: There are %s spam comments waiting for you to report them.
ru_ru: Вас ожидают %s спам-комментов.

source: There are %s comments waiting to be moderated.
ru_ru: Вашей модерации ожидают %s комментов.

source: History Size
ru_ru: Размер истории

source: Select the number of items to save in the History. Keep this small.
ru_ru: Выберите количество записей истории. Не храните слишком много.

source: Update Log Size
ru_ru: Установить размер лога

source: Clear Activity
ru_ru: Чистка лога

source: Clear Recent Activity
ru_ru: Очистить лог

source: Nothing in logs.
ru_ru: Ничего в логе нет.

source: Date/Time
ru_ru: Дата/время

source: Author, User/Pwd
ru_ru: Автор, User/Pass

source: Blog
ru_ru: Блог

source: Spam Reported
ru_ru: О спаме сообщили

source: Spam Already Reported
ru_ru: О спаме уже сообщали

source: Status
ru_ru: Статус

source: Settings
ru_ru: Настройки

source: Stop Spammers has prevented <strong>%s</strong> spammers from registering or leaving comments.
ru_ru: Stop Spammers не позволил <strong>%s</ strong> спамерам зарегистрироваться или оставлить комментарии.

source: user(s) has been denied access and <a href="admin.php?page=ss_allowrequests">requested</a> that you add them to the Allow List.
ru_ru: пользователей блокировано и <a href="admin.php?page=ss_allowrequests">запросов</a> на добавление в Белый список.

source: Report to SFS
ru_ru: Отчет в SFS

source: No Options Set
ru_ru: Нет настроек

source: No Comment ID Found
ru_ru: ID коммента не найдено

source: No Comment Found for %s
ru_ru: Не найдено коммента для %s

source: Cannot Report Spam without API Key
ru_ru: Без ключа API нельзя отсылать отчеты.

source: Recent Duplicate Entry
ru_ru: Дубликат - рапорт был

source: Returning from AJAX
ru_ru: Возвращение из AJAX

source: Not Enabled
ru_ru: Не включено

source: Access to the Stop Forum Spam Database Shows Errors
ru_ru: Доступ к Stop Forum Spam вернул ошибку

source: Response Was
ru_ru: Ответ Stop Forum Spam был

source: Access to the Stop Forum Spam Database is Not Working
ru_ru: Доступ к Stop Forum Spam не работает

source: Access to the Stop Forum Spam Database is Working
ru_ru: Доступ к Stop Forum Spam работает

source: No Response from the Stop Forum Spam API Call
ru_ru: Нет ответа от вызова API Stop Forum Spam

source: Function Not Found
ru_ru: Функция не найдена

source: Unrecognized function "%s"
ru_ru: Неизвестная функция "%s"

source: Something is missing "%s"
ru_ru: Ошибочный параметр "%s"

source: File Not Found
ru_ru: Файл не найден

source: Mixed
ru_ru: Разное

source: Mixed utils
ru_ru: Разное

source: TEST STRING TRANSLATE
ru_ru: Проверка строки ввода
