Repository: jetsam729/stop-bad-regs
Catalog: languages/sfs-plugin-*.po
Languages: ru_ru

source: Stop Spammers — Summary
ru_ru: Stop Spammers - Сводка

source: Summary
ru_ru: Сводка

source: Stop Spammers — Protection Options
ru_ru: Stop Spammers — Настройки защиты

source: Protection Options
ru_ru: Настройки защиты

source: Only Use the Plugin for Standard WordPress Forms
ru_ru: Использовать плагин только в стандартных формах

source: Stop Spammers normally kicks off whenever someone fills out a form and presses submit.<br />This means it checks all the forms on a website, not just comments and logins.<br />This option will limit the plugin to wp-comments-post.php and wp-login.php.<br />WooCommerce and other plugins will not be checked.<br />Use this option if you are running an ecommerce site or a specialized site that has forms that are blocked by Stop Spammers.<br />For the most protection, this option is off by default (recommended).
ru_ru: Stop Spammers обычно запускается всякий раз, когда кто-то заполняет форму и нажимает кнопку «Отправить».<br />Это означает, что он проверяет все формы на сайте, а не только комментарии и логины.<br />Эта опция ограничит плагин проверкой только wp-comments-post.php и wp-login.php. WooCommerce и другие плагины проверяться не будут.<br />Используйте эту опцию, если вы работаете с сайтом электронной коммерции или специализированным сайтом, на котором есть формы, заблокированные Stop Spammers.<br />Для большей защиты эта опция по умолчанию отключена (рекомендуется).

source: Prevent Lockouts
ru_ru: Предотвращение блокировки

source: This plugin aggressively checks for spammers and is unforgiving to the point<br />where even you may get locked out of your own website when you log off and try to log back in.<br />There are two options which help prevent this, but these options can make it easier for a spammer to hack your site.<br />When you are confident that the plugin is working you can uncheck these boxes.
ru_ru: Этот плагин активно проверяет спамеров и даже вы можете быть заблокированы на вашем собственном сайте, когда вы выходите из системы и пытаетесь войти в систему.<br />Есть два варианта, которые помогают предотвратить это, но эти варианты могут упростить доступ спамерам.<br />Если вы уверены, что плагин работает правильно, вы можете снять эти флажки.

source: Automatically Add Admins to Allow List
ru_ru: Автоматически добавлять в "белый список" всех админов.

source: Whenever an administrative user logs in, the IP address is added to the Allow List.<br />This means that you can't be locked out unless your IP address changes or you log in from a different location.<br />As soon as a login is successful then the IP is white-listed to prevent future problems.<br />Disable this if you think that you will never be locked out.
ru_ru: Всякий раз, когда администратор (admin) входит в систему, IP-адрес добавляется в список разрешенных.<br />Это означает, что вы не можете быть заблокированы, пока ваш IP-адрес не изменится или вы не войдете из другого места.<br />Как только вы успешно вошли - IP автоматом заносится в "белый список", чтобы предотвратить блокировку.<br />Отключите это (и это повысит бехопасность), если вы уверены, что никогда не будете заблокированы случайно.

source: Check Credentials on All Login Attempts
ru_ru: Проверять учетные данные при всех попытках входа

source: Normally the plugin checks for spammers before WordPress can try to log in a user.<br />If you check this box, every attempt to log in will be tested for a valid user.<br />This may allow a hacker to guess your user ID and password by making thousands of attempts to login.<br />This is turned on initially to prevent you from being locked out of your own blog,<br />but should be unchecked after you verify that the plugin does not think you are a spammer.
ru_ru: Обычно плагин проверяет спамеров, прежде чем WordPress попытается проверить пользователя.<br />Если этот флажок установлен, каждая попытка войти в систему будет проверена - есть ли такой пользователь.<br />Это может позволить злоумышленнику угадать ваш логин и пароль, сделав тысячи попыток входа в систему (bruteforce).<br />Первоначально эта функция включена, чтобы предотвратить блокировку вашего собственного входа,<br />но следует снять флажок после того, как вы убедитесь, что плагин не считает вас спамером.

source: Validate Requests
ru_ru: Проверять запросы

source: Spam bots do not always follow rules. They don't provide the proper request headers or are too quick.<br />These items can be quickly checked. These rules are the most economical way of detecting spammers.
ru_ru: Спамботы не всегда следуют правилам. Они часто не посылают надлежащие заголовки запроса или шлют слишком быстро.<br />Эти элементы могут быть быстро проверены. Эти правила являются наиболее экономичным способом выявления спамеров.

source: Block Spam Missing the HTTP_ACCEPT Header
ru_ru: Блокировать как спам, если поле заголовка HTTP_ACCEPT отсутствует.

source: Block Invalid HTTP_REFERER
ru_ru: Блокировать как спам, если поле заголовка HTTP_REFERER отсутствует.

source: Blocks users who have a missing or incomplete HTTP_ACCEPT header. All browsers provide this header.<br />If a hit on your site is missing the HTTP_ACCEPT header it is because a poorly written bot is trying access your site.
ru_ru: Блокировать пользователей, если заголовок HTTP_ACCEPT отсутствует или неполный. Этот заголовок есть во всех браузерах.<br />Если заголовок HTTP_ACCEPT отсутствует, то это, скорее всего, плохо написанный бот пытается получить доступ к Вашему сайту.

source: When you submit a form, all browsers provide the web page that submitted the form.<br />If this referring page is missing or does not match your website then the submission is probably from a program accessing your site.<br />Some phone apps try to log in without the correct header. You may want to disable this function<br />if you log into your website from your mobile device. Test it first - the better written apps provide the referring page.
ru_ru: Когда вы отправляете форму (post), все браузеры предоставляют веб-страницу, с которой отправлена форма.<br /> Если ссылка отсутствует или не соответствует вашему веб-сайту (странице с формой), то, вероятно, отправка была сделана спамботом. <br />Некоторые телефонные приложения пытаются войти без правильного заголовка (редко). Вы можете отключить эту функцию,<br />если вы заходите на свой веб-сайт с мобильного устройства, но сначала проверьте это - обычно все приложения отправляют поле HTTP_REFERER<br />(<small>параноиков отключающих куки, рефы. ассепты - в расчет не берем (-;</small>).

source: Deny Disposable Email Addresses
ru_ru: Блокировать одноразовые емейл-адреса

source: Spammers who want to hide their true identities use disposable email addresses.<br />You can get these from a number of sites. The spammer doesn't have to register. He just picks up any mail anonymously.<br />Legitimate users use their real email address. It is very likely that anyone using a disposable email address is a spammer.
ru_ru: Спамеры часто используют одноразовые адреса электронной почты.<br />Вы можете получить их на нескольких сайтах. Спамеру нужен емейл только для указания при регистрации.<br />Нормальные пользователи используют свой реальный адрес электронной почты.<br />Весьма вероятно, что любой, кто использует одноразовый адрес электронной почты, является спамером.<br /><small>список доменов одноразовых адресов - в файле chkdisp.php</small>

source: Check for Long Emails, Author Name, or Password
ru_ru: Проверки на слишком длинные емейл-адрес, имя или пароль.

source: Spammers can't resist using very long names and emails. This rejects these if they are over 64 characters in length.
ru_ru: Блокировать, если длина более 64 символов.

source: Check for Short Emails or Author Name
ru_ru: Проверка на слишком короткий емейл-адрес или имя.

source: Spammers sometimes use blank usernames or author names.<br />If you are having trouble with a plugin or theme not using the correct fields with rejects for short usernames, then uncheck this box.
ru_ru: Спаммеры иногда используют пустые имена пользователей.<br />Если у вас возникли проблемы с плагином или темой, не использующими правильные поля для коротких имен пользователей, снимите этот флажок.

source: Check for BBCodes
ru_ru: Проверка на BBCodes

source: BBCodes are codes like [url] that spammers like to place in comments.<br />WordPress does not support BBCodes without a plugin.<br />If you have a BBCode plugin then disable this. This will mark any comment that has BBCodes as spam.
ru_ru: BBCodes - это коды типа [url], которые спаммеры любят размещать в комментариях.<br /><strong>WordPress не поддерживает BBCodes без плагина</strong>.<br />Если у вас есть плагин BBCode, отключите его. Это пометит любой комментарий, который имеет BBCodes как спам.

source: Check for Quick Responses
ru_ru: Проверка скорости ответа

source: <em>(disabled if caching is active)</em> The plugin will drop a cookie with the current time in it.<br />When the user enters a comment or tries to log into the system, the time is checked.<br />If the user responds too fast, he is a spammer. If cookies are not supported, this is disabled.<br />Use the timeout value below to control the speed (stops the most spammers of all the methods listed here).
ru_ru: <em>(отключено, если кэширование активно)</em> Плагин удалит cookie с текущим временем в нем.<br />Когда пользователь вводит комментарий или пытается войти в систему, время проверяется.<br />Если пользователь отвечает слишком быстро, он (скорее всего) спамер. Если файлы cookie не поддерживаются, это отключено.<br />Используйте значение тайм-аута ниже, чтобы контролировать скорость (останавливает большинство спамеров из всех методов, перечисленных здесь).

source: Response Timeout Value
ru_ru: Время реакции

source: <br />This is the time used to determine if a spammer has filled out a form too quickly.<br />Humans take more than 10 seconds, at least, to fill out forms. The default is 4 seconds.<br />If a user takes 4 seconds or less to fill out a form they are not human and are denied.<br />Users who use automatic passwords may show up as false positives, so keep this low.
ru_ru: <br />Это время, используемое для определения того, заполнил ли спамер форму слишком быстро.<br />Людям требуется не менее 10-15 секунд, чтобы заполнить простые формы. По умолчанию это 4 секунды.<br />Если пользователю требуется 4 секунды или меньше, чтобы заполнить форму, он не является человеком и его блокируют.<br />Пользователи, использующие менеджеры паролей для ввода, могут дать ложные срабатывания, поэтому ставьте это значение низким.<br /><small>спамботы заполняют любые формы. практически, мгновенно.</small>

source: Deny 404 Exploit Probing
ru_ru: Блокировка при ошибке 404

source: Bots often search your site for exploitable files.<br />If there is a match to a known exploit URL,this will automatically add the IP address to the Deny List.
ru_ru: Боты часто ищут на сайте определенные файлы (уязвимрости, дырки, бэкапы и т.п.), которые можно использовать.<br />Если есть совпадение с известным URL (вредонос), это автоматически добавит IP-адрес в "черный список".<br /><small>например, sql.rar Или web.rar и т.п.</small>

source: Deny IPs Detected by Akismet
ru_ru: Блокировать IP с помощью Akismet

source: Akismet does a good job detecting spam. If Akismet catches a spammer, then the IP address should be added to the bad IP cache.<br />Akismet will continue to block comment spam, but if there is a login or registration attempt from the same IP, it will be blocked.
ru_ru: Akismet отлично справляется с обнаружением спама. Если Akismet ловит спамера, тогда IP-адрес должен быть добавлен в "черный список" (и badcache).<br />Akismet продолжит блокировать спам в комментариях, но при попытке входа или регистрации с того же IP-адреса он будет заблокирован уже плагином SFS.

source: Check for Exploits
ru_ru: Проверка на эксплойты

source: This checks for the PHP eval() function and typical SQL injection strings in comments and login attempts.<br />It also checks for JavaScript that may potentially be used for cross domain exploits.
ru_ru: Это проверяет попытку "пропихнуть" функцию PHP eval() и типичные строки SQL-инъекций в комментариях и попытках входа в систему.<br />Он также проверяет JavaScript, который потенциально может использоваться для междоменных эксплойтов.

source: Deny Login Attempts Using 'admin' in Username
ru_ru: Блокировка попыток входа с 'admin' в имени

source: When a spammer starts hitting the login page with 'admin' anywhere in the login ID<br />and there is no matching user, then it is a spammer trying to figure out your password.<br />Deny List immediately. This only works if you do not have any users with 'admin' in their username.<br />It is dangerous to have a username 'admin'. Sites get thousands of hits from bots trying to guess the admin password.<br />This has the side effect of preventing users from registering a username with the word admin in it.<br />Users cannot register with 'admin2' or 'superadmin' or 'Administrator.'
ru_ru: Когда спаммер начинает попадать на страницу входа с вхождением «admin» в любом месте в логине<br /> и нет подходящего пользователя, тогда это спамер, пытающийся подобрать ваш пароль.<br />В "черный список" немедленно. Это работает, только если у вас нет пользователей с «admin» в их имени пользователя.<br /> Иметь имя пользователя «admin» теперь опасно. Сайты получают тысячи обращений от ботов, пытающихся угадать пароль администратора (admin или root).<br /> Это побочный эффект, который не позволяет (Не рекомендует) пользователям регистрировать имя пользователя со словом admin.<br />Пользователи не могут зарегистрироваться с помощью «admin2», «superadmin» или «Administrator» (вхождение подстроки).

source: Check for Many Hits in a Short Time
ru_ru: Проверка активности в короткое время

source: Deny access when there are
ru_ru: Блокировать доступ когда

source: comments or logins in less than
ru_ru: постов или входов менее, чем за

source: minutes
ru_ru: минут(ы)

source: Spammers hit your site over and over again.<br />If you get more than %s hit(s) in %s minute(s), the spammer will be stopped,<br />added to the bad cache, and shown the challenge page.
ru_ru: Спаммеры попадают на ваш сайт снова и снова.<br />Если вы получите более %s попаданий за %s минут(ы), спамер будет остановлен, добавлен в badcache и направлен на страницу с запросом.

source: Filter Login Requests
ru_ru: Отслеживать попытки входа (login)

source: Some plugins and themes bypass the standard registration forms.<br />If you check this, Stop Spammers will try to intercept the login in the WordPress user login module.<br />This will cause some overhead, but gives Stop Spammers another shot at detecting spam.<br />This is turned off by default because it could potentially be called at every page load.
ru_ru: Некоторые плагины (и темы) обходят стандартные регистрационные формы.<br />Если вы включите эту опцию, Stop Spammers будет пытаться перехватить входа пользователя в WordPress.<br />Это вызовет накладные расходы, но даст Stop Spammers шанс для обнаружения спама.<br />Это отключено по умолчанию, потому что потенциально может вызываться <em>при каждой загрузке страницы</em>.<br /><small>если не установлено плангинов с custom формами регистрации или логина - не включайте эту опцию</small>

source: Check Against List of Ubiquity-Nobis and Other Spam Server IPs
ru_ru: Проверять по списку Ubiquity-Nobis и других спам-провайдеров

source: A list of hosting companies who tolerate spammers.<br />They are the source of many comment spam and login attempts. This blocks many of them.
ru_ru: Список хостингов, которые терпят спамеров.<br />Они являются источником множества спам-комментариев и попыток входа (bruteforce). Это блокирует многие из них.<br /><span class="ss-plugin-remark">jetsam: не рекомендую - ip меняются чаще, чем апдейт плагина. устарело.</span>

source: Check for Major Hosting Companies and Cloud Services
ru_ru: Проверка на принадлежность к крупныим хостингам

source: Your users should come from ISPs only. If a request comes from a web host such as Softlayer, Rackspace, or Amazon AWS,<br />it is likely that the the user is a spammer who is running some spam software to attack your site.
ru_ru: Ваши пользователи должны приходить только от интернет-провайдеров.<br />Если запрос поступает от веб-хостинга, такого как Softlayer, Rackspace или Amazon AWS,<br /> вполне вероятно, что пользователь является спамером.<br /><span class="ss-plugin-remark">jetsam: ip меняются чаще, чем апдейт плагина и инфа устаревает.</span>

source: Check for Amazon Cloud
ru_ru: Блокировать Amazon Cloud

source: You can block comments and logins from Amazon Cloud Servers using this setting.<br >It may be that good services use Amazon Cloud servers so you may not want to use this.<br >Be careful about blocking Amazon. Sometimes you get spam from one of their servers,<br >but they shut it down right away.
ru_ru: Используя этот параметр, вы можете блокировать комментарии и регистрацию с облачных серверов Amazon.<br />Есть вероятность, что хорошие сервисы используют серверы Amazon Cloud и вы зря заблокируете.<br />Будьте осторожны с блокировкой Amazon - это "облачный" сервис и может быть в роли прокси.<br /><span class="ss-plugin-remark">jetsam: пользователь с амазона, действительно, вряд ли придет.</span>

source: Block Countries
ru_ru: Блокировка по странам

source: Allow Lists
ru_ru: Белый список

source: Allow Options
ru_ru: Настройки разрешения

source: Save Changes
ru_ru: Сохранить изменения

source: Access Denied
ru_ru: Доступ запрещен

source: Login Access Denied
ru_ru: Вход запрещен

source: Missing file
ru_ru: Файловая ошибка

source: Options Updated
ru_ru: Настройки обновлены

source: This feature is to be considered experimental. Use with caution and at your own risk.
ru_ru: Это экспериментальные опции. Использовать с осторожностью!

source: Stop Spammers — Allow Lists
ru_ru: Stop Spammers — Белый список

source: These options will be checked first and will allow some users to continue without being checked further.
ru_ru: Эти параметры будут проверены в первую очередь и позволят некоторым пользователям продолжить работу без дальнейшей проверки.

source: You can prevent Google, PayPal, and other services from ever being blocked.
ru_ru: Вы можете предотвратить возможную блокировку Google, PayPal и т.п.

source: Put IP addresses or emails here that you don't want blocked. One email or IP to a line. You can use wild cards here for emails.
ru_ru: Добавьте здесь IP или емейл адреса, которым вы хотите разрешить доступ. Один емейл или один IP на строку.<br />Вы можете использовать подстановочные знаки (маски) для емейл адресов.

source: You may put user IDs here, but this is dangerous because spammers can easily find a user's ID from previous comments, and add comments using it.<br />I don't recommend using this. Normally user ID checking is turned off so you must check this box to use it.
ru_ru: Вы можете разместить здесь идентификаторы пользователей, но <strong>это опасно</strong>, поскольку спаммеры могут легко найти идентификатор пользователя из комментариев и добавлять комментарии, используя его.<br /><strong>Не рекомендуется использовать это</strong>. Обычно проверка идентификатора (ID) пользователя отключена,<br /> поэтому вы должны установить этот флажок, чтобы включить.

source: These are checked first so they override any blocking.
ru_ru: Белый список имеет приоритет - он отменяет любую блокировку, так как проверяется первым.

source: <strong>DON'T TOUCH.</strong> Google is very important to most websites. This prevents Google from being blocked.
ru_ru: <strong>НЕ ТРОГАТЬ.</strong> Google очень важен. Это предотвращает блокировку роботов Google.<br /><span class="ss-plugin-remark">jetsam: на самом деле спам боты сейчас ставят UserAgent гугла, так что - палка о двух концах. Наиболее точно - определять по geoip ASN</span>

source: Generated Allow List
ru_ru: Создавать "белый список"

source: An Allow List of well-behaved and responsible IP blocks in North America, Western Europe, and Australia.<br />These are a major source of spam, but also a major source of paying customers.<br />Checking this will let in some spam, but will not block residential ISP customers from industrialized countries.
ru_ru: Список разрешенных и надежных IP-блоков в Северной Америке, Западной Европе и Австралии.<br />Это основной источник спама, но также и основной источник платных клиентов.<br />Это повысит количество спама, но не заблокирует потенциальных клиентов интернет-провайдеров из промышленно развитых стран.<br /><span class="ss-plugin-remark">jetsam: спорное утверждение в эпоху VPS/VPN - лучше не включать</span>

source: Other Allow Lists
ru_ru: другие "белые списки"

source: A list of small web service providers that can be accidentally blocked as bad actors.<br />Currently on the list: VaultPress.<br />Request other services be added to this whitelist %s
ru_ru: <br />Список небольших поставщиков веб-услуг, которые могут быть случайно заблокированы как плохие участники.<br />В данный момент в списке: VaultPress.<br />Запросить добавление других служб в этот белый список %s.<br /><span class="ss-plugin-remark">jetsam: не советую. причина - IP меняются быстро. Сам уже и от Гугл-хостингов идет.</span>

source: Allow PayPal
ru_ru: Разрешить PayPal

source: If you accept payment through PayPal, keep this box checked.
ru_ru: Если вы принимаете платежи через PayPal - включите опцию.

source: Allow Yahoo Merchant Services
ru_ru: Разрешить Yahoo Merchant Services

source: If you use Yahoo Merchant Services, keep this box checked.
ru_ru: Если вы используете Yahoo Merchant - включите опцию.

source: Allow Amazon Cloud
ru_ru: Разрешить Amazon Cloud

source: The Amazon Cloud is the source of occasional spam, but they shut it down right away.<br />Lots of startup web services use Amazon Cloud Servers to host their services.<br />If you use a service to check your site, share on Facebook, or cross post from Twitter,<br />it may be using Amazon's cloud services. Check this if you want to always allow Amazon AWS.
ru_ru: Amazon Cloud является источником спама, но они оперативно закрывают спамеров.<br />Многие запускаемые веб-сервисы используют Amazon Cloud Servers для размещения своих сервисов.<br />Если вы используете сервис для проверки своего сайта, публикации в Facebook или публикации в Twitter,<br />это может быть использование облачных сервисов Amazon. Отметьте это, если вы хотите всегда разрешать Amazon AWS.<br /><span class="ss-plugin-remark">jetsam: не советую. причина - очень много попыток взлома из Amazon.</span>

source: Stop Spammers — Block Lists
ru_ru: Stop Spammers — Черный список

source: Block Lists
ru_ru: Черные списки

source: Block List
ru_ru: Черный список

source: Put IP addresses or emails here that you want blocked. One email or IP to a line.<br />You can mix email addresses and IP numbers. You can use IPv4 or IPv6 numbers.<br />You can use CIDR format to block a range (e.g. 1.2.3.4/16)<br />or you can use wild cards (e.g. spammer@spam.* or 1.2.3.*).<br />You can also use this to deny user IDs.<br />This is usually not useful as spammers can change the user ID that they use.<br />To block usernames in this list, check this box.
ru_ru: Добавьте здесь IP или емейл адреса, которые вы хотите блокировать. Один емейл или один IP-адес на строку.<br />Вы можете использовать ip в формате IPv4 и IPv6.<br />Также можно использовать диапазон адресов в формате CIDR (например: 1.2.3.4/16)<br />или подстановочные (маски) символы (пример spammer@spam.* или 1.2.3.*).<br />Также можно блокировать по ID пользователя.<br />Чтобы блокировать пользователя по нику включите флажок опции.
