Repository: jetsam729/stop-bad-regs
Catalog: languages/sfs-plugin-*.po
Languages: ru_ru

source: This is where you set up your Deny List for IPs and emails. It also allows you to enter spam words and phrases that trigger spam.
ru_ru: Здесь вы настраивали ваш "черный список" для IP-адресов и для емейл-адресов. Также вести стоп-лист спам-слов и фраз.

source: This sets up CAPTCHA and notification options. You can give users who trigger the plugin a second chance to use a CAPTCHA. Supports Google reCAPTCHA and Solve Media CAPTCHA.
ru_ru: Это устанавливает CAPTCHA и опции уведомления. Вы можете дать пользователям, вызывающим срабатывание защиты шанс, чтобы использовать CAPTCHA. Поддерживаются Google reCAPTCHA и Solve Media CAPTCHA.

source: Displays users who were denied and filled out the form requesting access to your site.
ru_ru: Отображает пользователей, которые были заблокированы и, которые заполнили форму обратной связи для доступа к вашему сайту.

source: This is where you enter the API keys for StopForumSpam.com and other web checking services. You don't need to have these set for the plugin to work, but if you do, you will have better protection and the ability to report spam.
ru_ru: Здесь вы можете ввести ключи API для StopForumSpam.com и других сервисов проверки. Это не обязательные настройки для работы плагина, но с ними у вас будет лучшая защита и возможность сообщать о спаме.

source: Shows the cache of recently detected events.
ru_ru: Показывает кэш недавно обнаруженных событий

source: Shows details of the most recent events detected by Stop Spammers.
ru_ru: Показывает детали самых последних событий, обнаруженных Stop Spammers.

source: You can use this to test an IP, email, or comment against all of the options. This can tell you more about why an IP address might fail. It will also show you any options that might crash the plugin on your site due to system settings.
ru_ru: Вы можете использовать это для проверки IP, электронной почты или комментария по всем параметрам.<br />Это может рассказать почему IP-адрес (блокировка по IP) может потерпеть неудачу.<br />Также может определить параметры, которые могут привести к сбою плагина на вашем сайте из-за настроек системы.

source: You are using the admin ID "admin". This is an invitation to hackers to try and guess your password. Please change this.<br />Here is discussion on WordPress.org
ru_ru: Вы используете ID (логин) администратора "admin". Хакеры постоянно будут пытаться подобрать (bruteforce) ваш пароль постоянно.<br />Пожалуйста, измените имя. Вот обсуждение (как это сделать) на WordPress.org:

source: Cloudflare Remote IP address detected. Please install the %s.<br />This plugin works best with the Cloudflare plugin when yout website is using Cloudflare.
ru_ru: Cloudflare заголовок (поле HTTP_CF_CONNECTING_IP) обнаружен. Пожалуйста, установите %s.<br />Этот плагин работает лучше в связке с Cloudflare-плагином, если Ваш хостинг на Cloudflare.

source: Cloudflare Plugin
ru_ru: Cloudflare плагин

source: Count
ru_ru: Количество

source: Date
ru_ru: Дата

source: Time
ru_ru: Время

source: Email
ru_ru: Емейл

source: Reason
ru_ru: Причина

source: Stop Spammers — Web Services
ru_ru: Stop Spammers — Настройки служб

source: There are many services that can be used to check for spam or protect your website against spammers.<br />Most require a key so that only registered users can use their services.<br />All of the services here can be used by Stop Spammers and all are free.
ru_ru: Существует множество сервисов, которые можно использовать для проверки спама или защиты вашего сайта от спамеров.<br />Большинству требуется ключ (регистрация на сервисе), чтобы их могли использовать только зарегистрированные пользователи.<br />На данной странице - настройки бесплатных (free) служб.

source: StopForumSpam.com API Key
ru_ru: Ключ для API StopForumSpam.com

source: Enable Stop Forum Spam Lookups: %s Check to enable SFS lookups
ru_ru: %s Установите флажок, чтобы включить поиск по базе StopForumSpam

source: You do not need an API key to check the Stop Forum Spam database, but if you want to report any spam that you find, you need to provide it here.<br />You can register and get an API key at %s.
ru_ru: Вам не нужен ключ API (регистрация) для проверки базы данных StopForumSpam, но если вы хотите сообщать о любом найденном спаме, Вы должны иметь ключ API.<br />Вы можете зарегистрироваться и получить ключ API на %s.

source: You can set the minimum settings to allow possible spammers to use your site.<br />You may wish to forgive spammers with few incidents or no recent activity.<br />I would recommend that to be on the safe side, you should block users who appear on the spam database unless they specifically ask to be Allow Listed.
ru_ru: Вы можете установить минимальные настройки, позволяющие возможным спамерам использовать ваш сайт.<br />Вы можете простить невольных спаммеров (из базы) за несколько инцидентов или без недавних действий - возможно это <em>динамический IP</em> и он уже не принадлежит спаммеру из баз.<br />Рекомендуем - в целях безопасности блокировать пользователей, которые появляются в базе данных спама, если они <em>специально</em> не просят включить их в список разрешенных.

source: Deny spammers found on Stop Forum Spam with more than %s incidents, and occurring less than %s days ago.
ru_ru: Блокировать спамерам c более чем %s записей в БД StopForumSpam и, если они не старше %s дней.

source: Allowed values are 0 to 9999. Only numbers are accepted.
ru_ru: Допустимый диапазон от 0 до 9999. Ввводить только число.

source: Project Honeypot API Key
ru_ru: Ключ для API Project Honeypot

source: This API key is used for querying the Project Honeypot Deny List.<br />It is required if you want to check IP addresses against the Project Honeypot database.<br />You can register and get an API key at %s.
ru_ru: Этот ключ API используется для запроса проекта Honeypot.<br />Это необходимо, если вы хотите проверить IP-адреса в базе данных Project Honeypot.<br />Вы можете зарегистрироваться и получить ключ API в %s.

source: Deny spammers found on Project HoneyPot with incidents less than %s days ago, and with more than %s threat level.<br />(25 threat level is average, threat level 5 is fairly low.)
ru_ru: Блокировать спамерам (БД HoneyPot) если они не старше %s дней и их уровень больше %s.<br />(уровень 25 - средний, уровень 5 - весьма низкий).

source: BotScout API Key
ru_ru: ключ для API BotScout

source: This API key is used for querying the BotScout database.<br />It is required if you want to check IP addresses against the botscout.com database.<br />You can register and get an API key at %s.
ru_ru: Этот ключ API используется для запросов к базе данных BotScout.<br /> Это необходимо, если вы хотите проверить IP-адреса в базе данных botscout.com.<br /> Вы можете зарегистрироваться и получить ключ API в %s.

source: Please note that BotScout is disabled in this release because of policy changes at botscout.com.
ru_ru: Обратите внимание, что BotScout пока отключен в этом выпуске из-за изменений политики на botscout.com

source: Deny spammers found on BotScout with more than %s incidents.
ru_ru: Блокировать если число записей в BotScout больше %s.

source: Check Against DNSBL Lists Such as Spamhaus.org
ru_ru: Проверять списки DNSBL, например, Spamhaus.org

source: Checks the IP on Spamhaus.org. This is primarily used for email spam, but the same bots sending out email spam are probably running comment spam and other exploits.
ru_ru: Проверяет IP по Spamhaus. В основном это используется для почтового спама, но боты, рассылающие спам по электронной почте, вероятно, могут и спаммить в комментариях и пытаться использовать и другие эксплойты.

source: Google Safe Browsing API Key
ru_ru: Клбч для API Google Safe Browsing

source: Sign up for a Google Safe Browsing API Key
ru_ru: Зарегистрируйтесь для получения ключа API Google Safe Browsing

source: If this API key is present, URLs found in comments will be checked for phishing or malware sites and if found, will be rejected.
ru_ru: Если есть этот ключ API, URL-адреса, найденные в комментариях, будут проверены на наличие фишинговых или вредоносных сайтов, а в случае наличия в базе - будут отклонены.

source: Plugins often don't clean up their mess when they are uninstalled. Some malicious themes and plugins use WordPress options to store some information.
ru_ru: Плагины часто не убирают свои настройки, когда их удаляют. Также, некоторые вредоносные темы и плагины используют параметры WordPress для хранения своей информации.

source: This function allows you inspect and delete orphan or suspicious options and to change plugin options so that they don't autoload.
ru_ru: на этой странице, вы можете проверить и удалить потерянные или подозрительные параметры (если точно знаете), а также изменить параметры плагинов, чтобы они не загружались автоматически.

source: In WordPress, some options are loaded whenever WordPress loads a page. These are marked as autoload options. This is done to speed up WordPress and prevent the programs from hitting the database every time some plugin needs to look up an option. Automatic loading of options at startup makes WordPress fast, but it can also use up memory for options that will seldom or never be used.
ru_ru: В WordPress некоторые параметры загружаются всякий раз, когда WordPress загружает страницу. Они помечены как параметры <em>автозагрузки</em>. Это сделано для ускорения WordPress и предотвращения вызыва плагинами базы данных каждый раз, когда какой-либо плагин грузит свои настройки. Автоматическая загрузка опций при запуске делает WordPress быстрым, но он также может использовать память для опций, которые редко или никогда не будут использоваться.

source: You can safely switch options so that they don't load automatically. Probably the worst thing that will happen is that the page will paint a little slower because the option is retrieved separately from other options. The best thing that can happen is there is a lower demand on memory because the unused options are not loaded when WordPress starts loading a page.
ru_ru: Вы можете безопасно отключать параметры, чтобы они <em>не загружались автоматически</em>. Вероятно, худшее, что может случиться - страница будет прорисоваться немного медленнее, потому что параметр извлекается отдельно от других параметров. Лучшее, что может случиться, - это более низкая потребность в памяти, поскольку неиспользуемые параметры не загружаются, когда WordPress начинает загружать страницу (если у вас много плагинов и мало памяти на хостинге под срипты).

source: When plugins are uninstalled they are supposed to clean up their options. Many plugins do not do any cleanup during uninstall. It is quite possible that you have many orphan options from plugins that you deleted long ago. These are autoloaded on every page, slowing down your pages and eating up memory. These options can be safely marked so that they will not autoload. If you are sure they are not needed you can delete them.
ru_ru: Когда плагины удалены, они должны очистить свои настройки, но многие плагины не выполняют никакой очистки при удалении. Вполне возможно, что у вас есть много плагинов, которые вы давно удалили. Они автоматически загружаются на каждой странице, замедляя ваши страницы и расходуя память. Эти параметры можно безопасно пометить, чтобы они не загружались автоматически. Если вы уверены, что они не нужны, вы можете и удалить их.

source: The change autoload column shows current autoload state. Yes means it is autoloading. No means that it is not.
ru_ru: В столбце «Изменение автозагрузки» отображается текущее состояние автозагрузки. <strong>Да</strong> означает, что это автозагрузка. <strong>Нет</strong> значит, что автозагрузка отключена.

source: You can change the autoload settings or delete an option on the form below. Be aware that you can break some plugins by deleting their options. I do not show most of the built-in options used by WordPress. The list below should be just plugin options.
ru_ru: Вы можете изменить настройки автозагрузки или удалить настройки в форме ниже. Имейте в виду, что вы можете сломать некоторые плагины, удалив их параметры. Большинство встроенных опций, используемых WordPress не показаны. В списке ниже должны быть только параметры плагинов.

source: It is far safer to change the autoload option value to "no" than to delete an option. Only delete an option if you are sure that it is from an uninstalled plugin. If you find your pages slowing down, turn the autoload option back to "yes".
ru_ru: Гораздо безопаснее изменить значение параметра автозагрузки на «Нет», чем удалить параметр. Удаляйте опцию только в том случае, если вы уверены, что она из удаленного плагина. Если вы обнаружите, что ваши страницы замедляются, установите для параметра автозагрузки значение «Да».

source: Option names are determined by the plugin author. Some are obvious, but some make no sense. You may have to do a little detective work to figure out where an option came from.
ru_ru: Названия опций определяются автором плагина. Некоторые из них очевидны, но некоторые не имеют видимого смысла. Возможно, вам придется даже стать детективом, чтобы выяснить, откуда же появилась эта опция.

source: contents of
ru_ru: содержимое (значение)

source: changing %s autoload to %s
ru_ru: сменить автозагрузку %s на %s

source: deleting %s
ru_ru: удаление %s

source: Option
ru_ru: Опция

source: Autoload
ru_ru: Автозагрузка

source: Size
ru_ru: Размер

source: Change Autoload
ru_ru: Сменить автозагрузку

source: Delete
ru_ru: Удалить

source: View Contents
ru_ru: Просмотр значения

source: Are you sure? There is not undo for this.
ru_ru: Вы уверены? Нет возможности отката (undo) изменений!

source: view
ru_ru: просмотр

source: Update
ru_ru: Обновить

source: WordPress creates temporary objects in the database called transients.<br />WordPress is not good about cleaning them up afterwards.<br />You can clean these up safely and it might speed things up.
ru_ru: WordPress создает временные объекты в базе данных, которые называются временными.<br />WordPress может не очистить их потом.<br />Вы можете очистить их безопасно, и это может ускорить процесс.

source: Delete Transients
ru_ru: Удалить Transients

source: Currently there are %s found.
ru_ru: Сейчас найдено %s.

source: This is a very simple threat scan that looks for things out of place in the content directory as well as the database.
ru_ru: Это очень простое сканирование угроз, которое ищет в каталоге WP, а также в базе данных.

source: The process searches PHP files for the occurrence of the eval() function, which, although a valuable part of PHP is also the door that hackers use in order to infect systems. The eval() function is avoided by many programmers unless there is a real need. It is often used by hackers to hide their malicious code or to inject future threats into infected systems. If you find a theme or a plugin that uses the eval() function it is safer to delete it and ask the author to provide a new version that does not use this function.
ru_ru: Процесс ищет в файлах PHP функцию <strong>eval()</strong>, которая, хотя и является ценной частью PHP, но чаще используется хакерами для заражения систем. Функция eval() избегается многими программистами, если в этом нет реальной необходимости. Он часто используется хакерами, чтобы скрыть свой вредоносный код или внедрить будущие угрозы в зараженные системы. Если вы найдете тему или плагин, который использует функцию eval(), безопаснее удалить его и попросить автора предоставить новую версию, которая не использует эту функцию.

source: The scan can take a few seconds and on larger or slower systems can time-out.
ru_ru: Сканирование может проходить достаточно долго, в более крупных или более медленных системах время ожидания может превысить ограничения хостинга на <em>время выполнения скрипта</em>.

source: Run Scan
ru_ru: Запустить сканирование

source: When you scan your system you undoubtedly see the eval used in Javascript because it is used in the Javascript AJAX and JSON functionality. The appearance of eval in these cases does not mean that there is a possible threat. It just means that you should inspect the code to make sure that it is in a Javascript section and not native PHP.
ru_ru: Когда вы сканируете свою систему, вы, несомненно, видите eval, используемый в Javascript, потому что он используется в функциях Javascript AJAX и JSON. Появление eval в этих случаях не означает, что существует возможная угроза. Это просто означает, что вы должны проверить код, чтобы убедиться, что он находится в разделе Javascript, а не в PHP.

source: The process continues its scan by checking the database tables for Javascript or HTML where it should not be found.
ru_ru: Процесс продолжает сканирование, проверяя таблицы базы данных на наличие Javascript или HTML, где b[ не должны быть.

source: Normally, Javascript can be found in the post body, but if the script tag is found in a title or a text field where it does not belong it is probably because the script is hiding something, such as a hidden admin user, so that the normal administration pages do not show bad records. The scan looks for this and displays the table and record number where it believes there is something hinky.
ru_ru: Обычно Javascript можно найти в теле сообщения, но если script tag находится в заголовке или текстовом поле, к которому он не принадлежит, это может быть связано с тем, что сценарий скрывает что-то, например скрытого пользователя-администратора, так что нормальные страницы администрирования не показывают плохие записи. Сканирование ищет это и отображает таблицу и номер записи, где, по ее мнению, есть что-то странное.

source: The scan continues looking in the database for certain HTML in places where it does not belong. Recent threats have been putting HTML into fields in the options table so that users will be sent to malicious sites. The presence of HTML in options values is suspect and should be checked.
ru_ru: Сканирование продолжает искать в базе данных HTML в тех местах, где он не должен быть. Недавние угрозы помещают HTML в поля таблицы параметров, чтобы пользователи перенаправлялись на вредоносные сайты. Наличие HTML в значениях параметров является подозрительным и должно быть проверено.

source: The options table will have things placed there by plugins so it is difficult to tell if scripts, iframes, and other HTML tags are a threat. They will be reported, but they should be checked before deleting the entries.
ru_ru: В таблице параметров сохраняются настройки плагинов, поэтому сложно определить, являются ли сценарии, iframes и другие теги HTML угрозой. О них будет сообщено, но они должны быть проверены перед удалением записей.

source: This process is just a simple scan and does not try to fix any problems. It will show things that may not be threats, but should be checked. If anything shows up, you should try to repair the damage or hire someone to do it. I am not a security expert, but a programmer who discovered these types of things in a friend's blog. After many hours of checking I was able to fix the problem, but a professional could have done it faster and easier, although they would have charged for it.
ru_ru: Этот процесс является очень простым сканированием и не пытается исправить какие-либо проблемы. Это покажет вещи, которые могут быть не угрозами, но должны быть проверены. Если что-то обнаруживается, вы должны попытаться исправить или нанять кого-то, чтобы сделать это.

source: You probably do not have a backup to your blog, so if this scan shows you are clean, your next step is to install one of the plugins that does regular backups of your system. Next, make sure you have the latest WordPress version.
ru_ru: Вероятно, у вас нет резервной копии блога, поэтому, если это сканирование показывает, что вы чисты, следующим шагом будет установка одного из плагинов, который регулярно создает резервные копии вашей системы. Затем убедитесь, что у вас установлена последняя версия WordPress.

source: If you think you have problems, the first thing to do is change your user ID and password. Next make a backup of the infected system. Any repairs to WordPress might delete important data so you might lose posts, and the backup will help you recover missing posts.
ru_ru: Если вы думаете, что у вас есть проблемы, первое, что нужно обязательно сделать - изменить свой логин пользователя и пароль. Далее сделайте резервную копию системы. Любой ремонт WordPress может удалить важные данные и вы можете потерять сообщения, а резервная копия поможет вам восстановить пропущенные сообщения.

source: The next step is to install the latest version of WordPress. The new versions usually have fixes for older threats.
ru_ru: Следующим шагом является установка последней версии WordPress. В новых версиях обычно есть исправления для старых угроз и ошибок.

source: You may want to export your WordPress posts, make a new clean installation of WordPress, and then import the old posts.
ru_ru: Вы можете экспортировать свои сообщения WordPress, сделать новую чистую установку WordPress, а затем импортировать старые сообщения.

source: If this doesn't work it is time to get a pro involved.
ru_ru: Если это не работает, пришло время привлечь профессионала.

source: A clean scan does not mean you are safe. Please do backups and keep your installation up-to-date!
ru_ru: Cканирование без угроз не означает, что вы в безопасности. Пожалуйста, делайте резервные копии и обновляйте свою установку!

source: Testing Posts
ru_ru: Тестируем посты (сообщения)

source: Nothing found in posts.
ru_ru: Ничего не найдено в постах(сообщениях)

source: Testing Comments
ru_ru: Тестируем комменты

source: Nothing found in comments.
ru_ru: Ничего не найдено в комментах

source: Testing Links
ru_ru: Тестируем ссылки

source: Testing Users
ru_ru: Тестируем пользователей

source: Nothing found in links.
ru_ru: В ссылках ничего не найдено

source: Nothing found in users.
ru_ru: В пользователях ничего не найдено

source: found possible problems in Users (%s) ID:%s
ru_ru: Возможно найдены проблемы в пользователях (%s) ID:%s

source: found possible problems in comment (%s) ID:%s
ru_ru: Возможно найдены проблемы в комментах (%s) ID:%s

source: found possible problems in post (%s) ID:%s
ru_ru: Возможно найдены проблемы в сообщениях (%s) ID:%s

source: found possible problems in links (%s) ID:%s
ru_ru: Возможно найдены проблемы в ссылках (%s) ID:%s

source: Testing Options Table for HTML
ru_ru: Тестируем таблицу настроек на содержание HTML кода

source: Nothing found in options.
ru_ru: Ничего не найдено в настройках

source: Found possible problems in Option %s (%s) option_id: %s value: %s
ru_ru: Найдены возможные проблемы в настройках %s (%s) id: %s строка: %s

source: Scanning Themes and Plugins for eval
ru_ru: Сканируем темы и плагины на функию eval()

source: Possible Problems Found!
ru_ru: Возможно найдены проблемы!

source: No Problems Found
ru_ru: Проблем не найдено.

source: These are warnings only. Some content and plugins might not be malicious, but still contain one or more of these indicators. Please investigate all indications of problems. The plugin may err on the side of caution.
ru_ru: Это только предупреждения. Некоторый контент и плагины могут не быть вредоносными, но все же содержат один или несколько из этих признаков. Пожалуйста, изучите все признаки проблем. Плагин может ошибаться.
