Repository: jetsam729/stop-bad-regs
Catalog: languages/sfs-plugin-*.po
Languages: ru_ru

source: These are checked after the Allow List so the Allow List overrides any blocking.
ru_ru: Проверка черного списка идет после проверки белого списка (т.е. <strong>белый список имеет приоритет</strong>!)

source: Spam Words List
ru_ru: Стоп-лист спам-слов

source: Use the spam words list to check comment body, email, and author fields.<br />If a word here shows up in an email address or author field then block the comment (wild cards do not work here)
ru_ru: Используйте список спам-слов для проверки комментариев, адреса емейл и полей в профиле пользователя.<br />Если слово из списка будет в адресе электронной почты, комменте или поле профиля, то комментарий блокируется<br />(внимание: подстановочные символы - маски - здесь не работают!)

source: Check Spam Words
ru_ru: Проверять на спам-слова

source: Add or delete spam words (one word per line)
ru_ru: Добавляйте или удаляйте спам-слова (по одному слову в строке)

source: Bad User Agents List
ru_ru: Черный список UserAgent (<small>идентификатор браузера</small>)

source: Check Agents
ru_ru: Проверять UserAgent

source: Browsers always include a user agent string when they access a site.<br />A missing user agent is usually a spammer using poorly written software or a leech who is stealing the pages from your site.<br />This option checks for a variety of user agents such as WGET and PHP, Java, or Ruby language standard agents.<br />It also checks for known abusive robots that sometimes submit forms.
ru_ru: Браузеры всегда включают строку <strong>UserAgent</strong> (кратко: UA) в заголовок http-запроса к сайту.<br />Отсутствие UserAgent часто является признаком спамера, использующим плохо написанное ПО.<br /> Включение опции проверяет наличие UA, например, агенты WGET и PHP, Java или Ruby.<br />Также проверяется на известных "плохих" роботов, которые пытаются автоматически размещать спам.

source: Add or delete agent strings (one word per line)
ru_ru: Добавить или удалить строку (или часть строки) - один агент на одной строке

source: This is a string search so that all you have to enter is enough of the agent to match. Telesoft matches Telesoft Spider or Telesoft 3.2.
ru_ru: Это частичный поиск (поиск вхождения указанной подстроки).<br />Например, указание <strong>Telesoft</strong> заблокирует и "Telesoft Spider" и "Telesoft 3.2" и "SubTelesoftTele"

source: Blocked TLDs
ru_ru: Блокировка доменных зон (TLDs)

source: Enter the TLD name including the '.' e.g. .XXX<br /><strong>This only works for email addresses entered by the user.</strong><br />This will block all comments and registrations that use this TLD in domains for emails.<br />If you have a problem with a more complex sub-domains you can also use this to check anything after the first period.<br />This is not for stopping domains, though. Entering '.xxx.ru' will stop 'user@mail.xxx.ru',but it will not stop 'user@xxx.ru'.<br />Blocked TLDs (One TLD per line not case sensitive)
ru_ru: Введите имя зоны включая точку перед именем, пример: .XXX<br /><strong>Это работает только при проверке емейл адреса пользователя</strong><br />Блокируется регистрация и любой коммент, если эта часть присутствует в емейле пользователя.<br />Вы можете, также, блокировать субдомены, например, ввод в стоп-лист'.xxx.tk'<br />заблокирует 'user@mail.xxx.tk', но не заблокирует 'user@xxx.tk'<br />Вводите по одной зоне на строку. регистр - не имеет значения (игнорируется)

source: A TLD is the last part of a domain like .COM or .NET.<br />You can block emails from various countries this way by adding a TLD such as .CN or .RU (these will block Russia and China).<br />It will not block the whole country.<br />A list of TLDs can be found at <a href="https://wikipedia.org/wiki/List_of_Internet_top-level_domains" target="_blank">Wikipedia list of internet top-level domains</a>.
ru_ru: TLD это часть после самой последней точки в имени домена, например .COM или .NET<br />Вы можете блокировать TLD разных стран, например, ввод .CN или .ES<br />заблокирует доменную зону Китай или Испания.<br />Список зон можно найти в википедии <a href="https://ru.wikipedia.org/wiki/Список_доменов_верхнего_уровня" target="_blank">Список доменов верхнего уровня</a>.

source: Spammer Message
ru_ru: Сообщение спаммеру

source: This message is only visible to spammers.<br />It only shows if spammers are rejected at the time the login or comment form is displayed.<br />You can use the shortcode <em>[reason]</em> to include the deny reason code with the message.<br />You can also use <em>[ip]</em> in your message which would be the user's IP address.<br />(You may not want to give spammers hints on how they were denied.)
ru_ru: Это сообщение видно только спамерам.<br />Оно только показывает, отклонены ли спаммеры во время отображения формы входа или комментария.<br />Вы можете использовать короткий код <em>[reason]</em>, чтобы включить в сообщение код причины отказа.<br />Вы также можете использовать в сообщении <em>[ip]</em>, который будет IP-адресом.<br />(<small>Возможно, вы не захотите давать спамерам подсказки о причине блокировки.</small>)

source: Send Spammer to Another Web Page
ru_ru: Перенаправить спаммера на другую страницу

source: Enable redirect
ru_ru: Включить перенаправление

source: If you want you can send the spammer to a web page.<br />This can be a custom page explaining terms of service for example.
ru_ru: Если вы хотите, вы можете отправить спамера на другую веб-страницу.<br />Это может быть пользовательская страница, объясняющая, например, условия обслуживания.<br /><small>а может быть и страница сайта КГБ.</small>

source: Allow Users to Add to the Allow Request List
ru_ru: Разрешить пользователям делать запрос в Лист Запроса Допуска

source: Users can see the form to add themselves to the request list, but lots of spammers fill it out randomly.<br />This hides the request form.
ru_ru: Пользователи могут видеть форму, чтобы добавить себя в список запросов, но спамеры заполняют ее случайным образом или спамом.<br />Это скрывает форму запроса.

source: Blocked users see the Allow Request form
ru_ru: Заблокированные могут увидеть форму запроса допуска

source: Notify Webmaster When a User Requests to be Added to the Allow List
ru_ru: Сообщать вебмастеру (админ), что поступил запрос на допуск.

source: Blocked users can add their email addresses to the the Allow List request.<br />This will also send you an email notification.
ru_ru: Заблокированные пользователи могут добавлять свои адреса электронной почты в запрос Cписка Доступа.<br />Это также отправит вам уведомление по емейл.

source: Enable email request
ru_ru: Разрешить запрос емейла

source: (Optional) email where requests are sent
ru_ru: (Необязательно) емейл, куда будут отправлятся запросы

source: Second Chance CAPTCHA Challenge
ru_ru: Второй шанс используя капчу

source: No CAPTCHA (default)
ru_ru: Без капчи (по-умолчанию)

source: Arithmetic Question
ru_ru: Вопрос математики - сложить/умножить

source: The plugin is extremely aggressive and will probably block some small number of legitimate users.<br />You can give users a second chance by displaying a CAPTCHA image and asking them to type in the letters that they see.<br />This prevents lockouts.<br />This option will override the email notification option above.<br />By default, the plugin will support the arithmetic question, which is okay.<br />For better results, use Google's reCAPTCHA, or you can try SolveMedia's CAPTCHA
ru_ru: Плагин чрезвычайно агрессивен и, вероятно, заблокирует небольшое количество легитимных пользователей.<br />Вы можете дать пользователям второй шанс, отобразив изображение CAPTCHA и попросив его ввести буквы, которые они видят.<br />Это предотвращает блокировки. Эта опция переопределит опцию уведомления (выше) по электронной почте.<br />По умолчанию плагин будет поддерживать арифметический вопрос, что нормально.<br />Для достижения лучших результатов используйте Google reCAPTCHA или можете попробовать SolveMedia CAPTCHA<br /><span class="ss-plugin-remark">jetsam: можно поставить, что-то типа invisible recaptcha плагин - очень хорошо работает.</span>

source: In order to use Solve Media or Google reCAPTCHA you will need to get an API key.<br />Open CAPTCHA is no longer supported so the arithmetic question will be used for those that had it set.
ru_ru: Чтобы использовать Solve Media или Google reCAPTCHA, вам необходимо получить ключ API.<br />Open CAPTCHA больше не поддерживается, поэтому арифметический вопрос будет использоваться для тех, кто его установил.

source: Google reCAPTCHA API Key
ru_ru: Ключ для API Google reCAPTCHA

source: These API keys are used for displaying a Google reCAPTCHA on your site.<br />You can display the reCAPTCHA in case a real user is blocked, so they can still leave a comment.<br />You can register and get an API key at %s.<br />If the keys are correct you should see the reCAPTCHA here
ru_ru: Эти ключи API используются для отображения Google reCAPTCHA на вашем сайте.<br />Вы можете отобразить reCAPTCHA в случае, если реальный пользователь заблокирован, поэтому он все еще может оставить комментарий.<br />Вы можете зарегистрироваться и получить ключ API на %s.<br />Если ключи верны, вы должны увидеть reCAPTCHA здесь

source: If the reCAPTCHA form looks good, you need to enable the reCAPTCHA on the Challenge &amp; Deny options page. (see left)
ru_ru: Если форма reCAPTCHA выглядит хорошо, вам нужно включить reCAPTCHA на странице параметров Challenge Deny. (см. слева)

source: This API key is used for displaying a Solve Media CAPTCHA on your site.<br />You can display the CAPTCHA in case a real user is blocked, so they can still leave a comment.<br />You can register and get an API key at %s .<br />If the keys are correct you should see the CAPTCHA here
ru_ru: Этот ключ API используется для отображения Solve Media CAPTCHA на вашем сайте.<br />Вы можете отобразить CAPTCHA в случае, если реальный пользователь заблокирован, поэтому он все еще может оставить комментарий.<br />Вы можете зарегистрироваться и получить ключ API %s.<br />Если ключи верны, вы должны увидеть CAPTCHA здесь

source: Stop Spammers — Allow Requests
ru_ru: Stop Spammers - Запрос допуска

source: Allow List Requests
ru_ru: Список запросов на допуск

source: Allow Requests
ru_ru: Запрос допуска

source: Requests Cleared
ru_ru: Запросы удалены

source: Clear the Requests
ru_ru: Удалить запросы

source: When users are blocked they can fill out a form asking to be added to the allow list.<br />Any users that have filled out the form will appear below.<br />Some spam robots fill in any form that they find so their may be some garbage here.
ru_ru: Если пользователи заблокированы, они могут заполнить форму с просьбой добавить их в список доступа.<br />Все пользователи, заполнившие форму, появятся ниже.<br />Некоторые спам-роботы заполняют любую форму, которую они находят, поэтому здесь может быть мусор.

source: No requests.
ru_ru: Запросов нет.

source: Cache Clear
ru_ru: Очистить Cache

source: Bad Cache Clear
ru_ru: Очистить кэш блокировок

source: Good Cache Clear
ru_ru: Очистить кэш разрешений

source: Bad Cache Cleared
ru_ru: Cache блокировок очищен

source: Good Cache Cleared
ru_ru: Cache разрешений очищен

source: Cache Cleared
ru_ru: Cache очищен

source: Whenever a user tries to leave a comment, register, or login, they are recorded in the Good Cache<br />if they pass or the Bad Cache if they fail. If a user is blocked from access, they are added to the Bad Cache.<br />You can see the caches here. The caches clear themselves over time,<br />but if you are getting lots of spam it is a good idea to clear these out manually by pressing the "Clear Cache" button.
ru_ru: Каждый раз, когда пользователь оставляет комментарий, регистрирeтся или входит, он записывается в «хороший кэш», если он прошел проверку,<br /> или в «плохой кэш», если он заблокирован. Если пользователь заблокирован, он добавляется в «плохой кэш».<br />Вы можете увидеть список здесь. Кеши очищаются со временем, но если вы получаете много спама, рекомендуется удалить их вручную, нажав кнопку «Очистить кэш».

source: You can change the number of entries to keep in your history and cache.<br />The size of these items is an issue and will cause problems with some WordPress installations.<br />It is best to keep these small.
ru_ru: Вы можете изменить количество записей, сохраняемых в вашей истории и кэше.<br />Не делайте это слишком большим, так как это может привести к нехватке памяти в плагине.

source: Select the number of items to save in the bad IP cache.<br />Avoid making this too big as it can cause the plugin to run out of memory.
ru_ru: Выберите количество элементов для сохранения в кеше плохого IP.<br />Не делайте это слишком большим, так как это может привести к нехватке памяти в плагине.

source: The good cache should be set to just a few entries.<br />The first time a spammer hits your site he may not be well-known and once he gets in the Good Cache<br />he can hit your site without being checked again.<br />Increasing the size of the cache means a spammer has more opportunities to hit your site without a new check.
ru_ru: Хороший кеш должен быть установлен всего на несколько записей.<br />Когда спамер попадает на ваш сайт в первый раз, он может быть не очень известен, и если он попадет в Good Cache<br />он имеет шансы попасть на ваш сайт без повторной проверки.<br />Увеличение размера кэша означает, что у спаммера появляется больше шансов попасть на ваш сайт без новой проверки.

source: Bad Cache Size
ru_ru: Размер «плохой кэш»

source: Bad IP Cache Size
ru_ru: Размер «плохой кэш»

source: Good IP Cache Size
ru_ru: Размер «хороший кэш»

source: Good Cache Size
ru_ru: Размер «хороший кэш»

source: Nothing in the cache.
ru_ru: в кэше ничего нет

source: Cached Values
ru_ru: Содержимое кэша

source: Rejected IPs
ru_ru: Блокированные IP

source: Good IPs
ru_ru: Белый список IP

source: Options have not changed
ru_ru: Настройки не изменились

source: Look Up WHOIS
ru_ru: посмотреть в WHOIS

source: Delete %s from Cache
ru_ru: Удалить %s из кэша

source: Add %s to Deny List
ru_ru: Добавить %s в Черный список

source: Add %s to Allow List
ru_ru: Добавить %s в Белый список

source: Search %s in StopForumSpam.com
ru_ru: Искать %s на сайте StopForumSpam.com

source: Log Report — Stop Spammers
ru_ru: Лог отчетов — Stop Spammers

source: Log Report
ru_ru: Лог отчетов

source: Stop Spammers — Diagnostics
ru_ru: Stop Spammers — Диагностика

source: Diagnostics
ru_ru: Диагностика

source: This allows you to test the plugin against an IP address.
ru_ru: Здесь можно протестировать работу плагина с Вашим IP адресом.

source: Option Testing
ru_ru: Настройки тестирования

source: Your server address is
ru_ru: Адрес сервера

source: Author/User
ru_ru: Автор/логин

source: Subject
ru_ru: Тема

source: Comment
ru_ru: Коммент

source: Test Options
ru_ru: тестировать

source: Test Countries
ru_ru: тестировать страны

source: Memory used, peak: %s, %s
ru_ru: Памяти занято %s, пик %s

source: Allow Checks.
ru_ru: Проверки разрешения (допуск).

source: Deny Checks
ru_ru: Проверки запрета (блок)

source: Add-on Checks
ru_ru: Проверки аддонами

source: Display All Options
ru_ru: Показ всех опций/настроек

source: Dump Options
ru_ru: дамп настроек

source: Dump Stats
ru_ru: дамп статистики

source: You can dump all options here (useful for debugging)
ru_ru: Полный дамп настроек (<em>полезно для отладки</em>)

source: Display All Stats
ru_ru: Показ всей статистики

source: You can dump all stats here
ru_ru: Здесь вы можете сделать дамп всей статистики

source: Show PHP Info
ru_ru: показать вывод phpinfo()

source: Debug File deleted
ru_ru: Лог отладки удален

source: Debug Output
ru_ru: Отладочный вывод

source: end of file (if empty, there are no errors to display)
ru_ru: конец лога (<small>если пусто - значит ошибок не было</small>)

source: Show Debug File
ru_ru: Показать лог отладки

source: Delete Debug File
ru_ru: Удалить лог отладки

source: DB Cleanup
ru_ru: Чистка базы

source: Stop Spammers — DB Cleanup
ru_ru: Stop Spammers — Чистка базы

source: Stop Spammers — Threat Scan
ru_ru: Stop Spammers — Сканирование угроз

source: Threat Scan
ru_ru: Скан угроз

source: Summary Cleared
ru_ru: Сводка обнулена

source: Jetpack Protect has been detected. Stop Spammers has disabled itself.<br />Please turn off Jetpack Protect or uninstall Stop Spammers.
ru_ru: Обнаружен <strong>Jetpack Protect</strong>. Stop Spammers автоматически отключен.<br />Или выключите Jetpack Protect или удалите Stop Spammers - <strong>плагины несовместимы</strong>.

source: Beta Options
ru_ru: Beta настройки

source: Delete leftover options from deleted plugins or anything that appears suspicious.
ru_ru: Удалить оставшиеся опции (настройки) от удаленных плагинов или всего, что кажется Вам подозрительным.

source: A simple scan to find possibly malicious code.
ru_ru: Простое сканирование для поиска (<span style="font-style:italic;">возможно</span>) вредоносного кода.

source: Your current IP address is
ru_ru: Ваш IP адрес

source: This address is invalid for testing for the following reason
ru_ru: Этот IP адрес не подходит для теста по причине

source: Stop Spammers in total has stopped %s spammers since %s.
ru_ru: Stop Spammers <strong>всего блокировал</strong> %s спаммеров с %s.

source: Stop Spammers has stopped %s spammers since %s.
ru_ru: Stop Spammers блокировал %s спаммеров с %s.

source: This is cheating! Enter a new Total Spam Count
ru_ru: Чит! Введите желаемые блокировки и дату начала работы :)

source: Update Total Spam
ru_ru: Обновить счетчик

source: <br />If you working on a local installation of WordPress, this might be OK.<br />However, if the plugin reports that your IP is invalid it may be because you are using Cloudflare or a proxy server to access this page.<br />This will make it impossible for the plugin to check IP addresses.<br />You may want to go to the Stop Spammers Testing page in order to test all possible reasons<br />that your IP is not appearing as the IP of the machine that your using to browse this site.<br />It is possible to use the plugin if this problem appears, but most checking functions will be turned off.<br />The plugin will still perform spam checks which do not require an IP.<br />If the error says that this is a Cloudflare IP address, you can fix this by installing the Cloudflare plugin.<br />If you use Cloudflare to protect and speed up your site then you MUST install the Cloudflare plugin.<br />This plugin will be crippled until you install it.
ru_ru: <br />Если вы работаете с локальной установкой WordPress, это может быть нормально.<br />Eсли плагин сообщает, что ваш IP-адрес недействителен, это может быть связано с тем, что вы используете Cloudflare<br />(или wordpress работает под связкой frontend+backend, например nginx+apache)<br />или вы используете прокси-сервер для доступа к этой странице.<br />Это может сделать невозможным проверки IP-адресов.<br />Вы можете перейти на страницу «Stop Spammers Диагностика», чтобы проверить все возможные причины<br />по которым ваш IP-адрес не отображается в качестве IP-адреса компьютера, который Вы используете для просмотра этого сайта.<br />Можно будет использовать плагин, если эта проблема останется, но большинство функций проверки (по ip-адресам) будут отключены.<br />Плагин будет по-прежнему выполнять проверку на спам, который не требует проверки по IP-адресу.<br />Если ошибка из-за использования хостинга Cloudflare, это можно исправить, установив плагин Cloudflare.<br />Если Вы используете Cloudflare для защиты и ускорения своего сайта, Вы <strong>ДОЛЖНЫ</strong> установить плагин Cloudflare<br />иначе Stop Spammers будет выполнять проверки только частично.

source: Summary of Spam
ru_ru: Сводка по спаму

source: Clear Summary
ru_ru: Очистить статистику

source: Pass Good Cache
ru_ru: Попаданий в "белый" кэш

source: Reported by Akismet
ru_ru: Поймано Akismet

source: Pass Scripts
ru_ru: Сработал блок скриптов

source: Pass Uncheckable IP
ru_ru: Сработал блок Uncheckable IP

source: Allow List Email
ru_ru: Сработал блок "белый список" емейл

source: Allow User ID/Author
ru_ru: Сработал блок "белый список" ID/пользователь

source: Pass Allow List IP
ru_ru: Сработал блок "белый список" IP-адресов

source: 404 Exploit Attempt
ru_ru: Блок 404 ошибки

source: Bad or Missing Accept Header
ru_ru: Блок отсутствия поля Accept в запросе

source: Admin Login Attempt
ru_ru: Попыток войти Admin'ом

source: Passed Login OK
ru_ru: Разрешено войти

source: Bad or Missing User Agent
ru_ru: "плохой" UserAgent

source: Deny List Email
ru_ru: "Черный список" емейл

source: Deny User ID/Author
ru_ru: Блок по ID/нику

source: Deny List IP
ru_ru: "Черный список" IP

source: BotScout
ru_ru: DNSBL BotScout

source: Disposable Email
ru_ru: Одноразовый Email

source: DNSBL Hit
ru_ru: Блок через DNSBL

source: Exploit Attempt
ru_ru: Попытки Exploit

source: Project Honeypot
ru_ru: Проект Honeypot

source: Block Invalid IP
ru_ru: Блок Invalid IP

source: Long Email
ru_ru: Емейл очень длинный

source: Short Email
ru_ru: Емейл слишком короткий

source: BBCode in Request
ru_ru: BBCode в запросе

source: Bad HTTP_REFERER
ru_ru: Блок по REFERER

source: Stop Forum Spam
ru_ru: StopForumSpam.com

source: Spam Words
ru_ru: Спам-слов

source: Email TLD
ru_ru: Доменные зоны емейла

source: Repeated Hits
ru_ru: Повторные попытки/попадания

source: Check for Standard Form
ru_ru: Проверка стд форм

source: Passed CAPTCHA
ru_ru: CAPTCHA пройдена

source: Failed CAPTCHA
ru_ru: CAPTCHA НЕ пройдена

source: Total Pass
ru_ru: Блок всего

source: Amazon AWS Allow
ru_ru: Amazon AWS разрешено

source: Pass Cloudflare
ru_ru: Пропущено Cloudflare

source: Pass Google
ru_ru: Сработал Google

source: Known Spam Host
ru_ru: Известные спам-хостинги

source: Pass PayPal
ru_ru: сработал PayPal

source: Pass Yahoo merchant
ru_ru: сработал Yahoo merchant

source: Pass Allow List
ru_ru: Сработал "белый список"

source: Pass Generated Allow List
ru_ru: Сработал генератор "белого списка"

source: Get Support and Help Improve Stop Spammers
ru_ru: Получить поддержку и/или помочь улучшить плагин

source: Free Support
ru_ru: Бесплатная поддержка

source: Paid Support
ru_ru: Платная поддержка

source: If you need more advanced help securing your site or other web services,<br />and are interested in hiring me, please <a href="mailto:bhadaway@gmail.com">email me</a>. — <em>Bryan</em>
ru_ru: Если вам нужна более сложная (дополнительная) помощь в обеспечении безопасности вашего сайта или других веб-сервисов<br />и вы хотите нанять меня - напишите мне <a href="mailto:bhadaway@gmail.com">email me</a>. — <em>Bryan</em>

source: Plugin Options
ru_ru: Опции плагина

source: This checks to see if there may be problems from your current incoming IP address and displays a summary of events.
ru_ru: Сводка статистики и проверка, есть ли проблемы с IP-адресами (правильно ли настроены заголовки в запросах).

source: This has all the options for checking for spam and logins. You can also block whole countries.
ru_ru: Здесь есть все возможности для проверки на спам и логины. Вы также можете заблокировать целые страны.

source: Here you can set up your Allow List to allow IP addresses to log in and leave comments on your site, without being checked for spam. It also sets up the options which you can use to allow certain kinds of users into your site, even though they may trigger spam detection.
ru_ru: Здесь вы можете настроить свой "белый список", чтобы IP-адреса могли входить в систему и оставлять комментарии на вашем сайте без проверки на спам.<br />Также установить параметры, которые вы можете использовать, чтобы разрешить определенным типам пользователей посещать ваш сайт, даже если они могут вызвать срабатывание защиты от спама.
